# 顺序表的基本存储
a = [11, 99, 29, 88]
"""0x23 -> 11
   0x27 -> 99
   0x31 -> 29
   0x35 -> 88
"""


b = [11, "abc", 99, "ccc"]
# 存储不同元素时,存储外置
"""0x23 -> 0x100 -> 11
   0x27 -> 0x200 -> abc
   0x31 -> 0x30  -> 99
   0x35 -> 0x79  -> ccc
"""
# 顺序表的一体式存储结构
c = [2, 5, 7, 9]
"""
    0x15 8 容量
    0x19 4 现有元素个数
    0x23 2
    0x27 5
    0x31 7
    0x35 9
"""
# 顺序表的分离式存储结构
d = [3, 8, 5, 2]
"""
    0x15  8 容量
    0x19  4 现有元素个数
    0x23  0x111
    
    0x111 3
    0x115 8
    0x119 5
    0x123 2
方便增加和删除元素,一般采用这种
"""
"""元素存储区扩充:扩充固定数目,例如10个,扩充频繁,节省空间
                扩充倍数:成倍扩充,浪费空间      
"""